using System;

namespace DamkaProject
{
    class Program
    {
        public static void Main()
        {
            Game game = new Game(); 
            game.Run();
            Console.WriteLine("Press any key to continue...");
            Console.ReadLine();
        }
    }
}
/*

משימות שבוצעו:
-אם יש דילוג אז מחשב מבצע אותו
-לאחר ביצוע צעד מודפס הצעד הקודם
-להוסיף לחיצה אם אני רוצה לראות את מהלך המחשב
-אם יש דילוג נוסף מאותו הכלי אז התור נשאר  



משימות שנותרו: 
- \להוסיף ניקוד בין השחקנים - Niv
-מחיקת המסך בין כל תור 
- לשאול את המשתמש אם הוא רוצה לשחק משחק נוסף, אם כן זה יהיה עם אותם שחקנים ובאותו גודל לוח - Niv
- אם באלנו בינה מלאכותית אז אם המחשב מגיע לשורה אחת לפני אחרונה הוא יבחר להפוך למלך
- מה קורה במצב שאין מהלכים-מחשב+שחקן choseNextMove
- 

 */

