using System;

namespace DamkaProject
{
    class Program
    {
        public static void Main()
        {
            Game game = new Game(); 
            game.Run();
            Console.WriteLine("Press any key to continue...");
            Console.ReadLine();
        }
    }
}
/*

משימות שבוצעו:
- פונקציה\ GAMEOVER בודקת כל תור אם זה תיקו הפסד או ניצחון2. - Done
- \להוסיף יציאה מהמשחק על ידי Q - Done
- להגביל את השם השני שלא יהיה כמו הראשון - Done

משימות שנותרו: 
- להוסיף צד מחשב + גם כאשר המחשב עושה מהלך צריך להדפיס את המהלך למסך באותו פורמט
- \להוסיף ניקוד בין השחקנים - Niv
- מחיקת הלוח בכל תור +  לשנות פורמט הדפסה שלאחר ההדפסה יוצג המהלך הקודם
-אם יש דילוג נוסף אז התור נשאר 
- לשאול את המשתמש אם הוא רוצה לשחק משחק נוסף, אם כן זה יהיה עם אותם שחקנים ובאותו גודל לוח - Niv

 */

